Revit 2024 API
RailingSlopeOption Enumeration
 The option determines the slope of the railing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum RailingSlopeOption
Visual Basic
Public Enumeration RailingSlopeOption
Visual C++
public enum class RailingSlopeOption
Members
Member name | Description
ByHost |  The slope of the railing is determined by its host.
Flat |  The slope of the railing will be kept flat.
Sloped |  The slope of the railing will be specified by users.
See Also
Autodesk.Revit.DB.Architecture Namespace